; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=81, out_folder=htg/blocksworld//training, instance_id=61, seed=2085

(define (problem blocksworld-61)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 - object)
 (:init 
    (arm-empty)
    (clear b29)
    (on-table b29)
    (clear b60)
    (on b60 b55)
    (on b55 b49)
    (on b49 b32)
    (on b32 b17)
    (on b17 b9)
    (on b9 b35)
    (on b35 b4)
    (on b4 b79)
    (on b79 b44)
    (on b44 b41)
    (on b41 b42)
    (on b42 b21)
    (on b21 b28)
    (on b28 b51)
    (on b51 b77)
    (on b77 b68)
    (on b68 b54)
    (on-table b54)
    (clear b81)
    (on-table b81)
    (clear b7)
    (on b7 b10)
    (on-table b10)
    (clear b45)
    (on-table b45)
    (clear b18)
    (on b18 b65)
    (on b65 b47)
    (on b47 b69)
    (on b69 b50)
    (on b50 b73)
    (on b73 b52)
    (on b52 b63)
    (on b63 b64)
    (on b64 b67)
    (on-table b67)
    (clear b70)
    (on b70 b59)
    (on b59 b61)
    (on b61 b78)
    (on b78 b39)
    (on b39 b24)
    (on b24 b25)
    (on-table b25)
    (clear b62)
    (on-table b62)
    (clear b58)
    (on b58 b3)
    (on b3 b1)
    (on b1 b15)
    (on b15 b36)
    (on b36 b2)
    (on b2 b16)
    (on-table b16)
    (clear b19)
    (on b19 b66)
    (on b66 b72)
    (on b72 b53)
    (on b53 b33)
    (on b33 b38)
    (on b38 b31)
    (on b31 b75)
    (on b75 b48)
    (on b48 b46)
    (on b46 b43)
    (on b43 b71)
    (on b71 b76)
    (on b76 b40)
    (on b40 b20)
    (on b20 b11)
    (on b11 b57)
    (on b57 b37)
    (on b37 b13)
    (on b13 b80)
    (on b80 b27)
    (on b27 b56)
    (on-table b56)
    (clear b34)
    (on b34 b14)
    (on b14 b74)
    (on b74 b23)
    (on-table b23)
    (clear b5)
    (on b5 b8)
    (on b8 b6)
    (on b6 b26)
    (on b26 b30)
    (on b30 b22)
    (on b22 b12)
    (on-table b12))
 (:goal  (and 
    (clear b6)
    (on b6 b4)
    (on b4 b5)
    (on b5 b1)
    (on b1 b8)
    (on-table b8)
    (clear b2)
    (on b2 b3)
    (on b3 b7)
    (on-table b7))))

; plan
1. (unstack b7 b10)
   deleted: (on b7 b10) (clear b7) (arm-empty)
   added: (holding b7) (clear b10)
   goals met: 0 of 10
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 10
3. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 1 of 10
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 10
5. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 2 of 10
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 10
7. (unstack b58 b3)
   deleted: (on b58 b3) (clear b58) (arm-empty)
   added: (holding b58) (clear b3)
   goals met: 3 of 10
8. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 3 of 10
9. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 3 of 10
10. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 4 of 10
11. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 10
12. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 5 of 10
13. (unstack b60 b55)
   deleted: (on b60 b55) (clear b60) (arm-empty)
   added: (holding b60) (clear b55)
   goals met: 5 of 10
14. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 5 of 10
15. (unstack b55 b49)
   deleted: (on b55 b49) (clear b55) (arm-empty)
   added: (holding b55) (clear b49)
   goals met: 5 of 10
16. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 10
17. (unstack b49 b32)
   deleted: (on b49 b32) (clear b49) (arm-empty)
   added: (holding b49) (clear b32)
   goals met: 5 of 10
18. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 5 of 10
19. (unstack b32 b17)
   deleted: (on b32 b17) (clear b32) (arm-empty)
   added: (holding b32) (clear b17)
   goals met: 5 of 10
20. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 5 of 10
21. (unstack b17 b9)
   deleted: (on b17 b9) (clear b17) (arm-empty)
   added: (holding b17) (clear b9)
   goals met: 5 of 10
22. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 10
23. (unstack b9 b35)
   deleted: (on b9 b35) (clear b9) (arm-empty)
   added: (holding b9) (clear b35)
   goals met: 5 of 10
24. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 10
25. (unstack b35 b4)
   deleted: (on b35 b4) (clear b35) (arm-empty)
   added: (holding b35) (clear b4)
   goals met: 5 of 10
26. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 5 of 10
27. (unstack b6 b26)
   deleted: (on b6 b26) (clear b6) (arm-empty)
   added: (holding b6) (clear b26)
   goals met: 4 of 10
28. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 6 of 10
29. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 5 of 10
30. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 10
31. (unstack b1 b15)
   deleted: (on b1 b15) (clear b1) (arm-empty)
   added: (holding b1) (clear b15)
   goals met: 5 of 10
32. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 6 of 10
33. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 10
34. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 10
35. (unstack b15 b36)
   deleted: (on b15 b36) (clear b15) (arm-empty)
   added: (holding b15) (clear b36)
   goals met: 7 of 10
36. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 7 of 10
37. (unstack b36 b2)
   deleted: (on b36 b2) (clear b36) (arm-empty)
   added: (holding b36) (clear b2)
   goals met: 8 of 10
38. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 8 of 10
39. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 7 of 10
40. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 10
41. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 7 of 10
42. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 8 of 10
43. (unstack b4 b79)
   deleted: (on b4 b79) (clear b4) (arm-empty)
   added: (holding b4) (clear b79)
   goals met: 8 of 10
44. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 9 of 10
45. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 10
46. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 10 of 10
